#+PROPERTY: header-args :results verbatim :tangle pgpb-org-files.el :session pgpb :cache no
#+auto_tangle: true

** TODO Create new Org file with encryption enabled

   Adapted from: [[id:062FBE2C-2267-4F81-9C15-0BC0A3DC84E8][General case: new empty Org file]]

   A new file can be created using one of the following methods:
   
   1. Call interactively: =M-x pgpb-org-new=
   2. Run with Babel: =C-c C-c=
      #+begin_src elisp :tangle no :results value file
        (pgpb-org-new)
      #+end_src

      #+RESULTS:
      [[file:~/org/31e520d4df/9beb1205f9.org.gpg]]


   The interactive function will ask the user to select the target
   directory for the new Org file and will create an empty Org file
   with a random name.

   #+begin_src elisp
     (defun pgpb-org-new ()
       "Create new Org file. Use my GPG keys for encryption."
       (interactive)

       (let ((options (pgpb-org-new-options)))
         (let ((selected (completing-read "Choose dir: " options nil t)))
           (let ((out-dir (cdr (assoc selected options))))
             (let ((filename (format "%s/%s" out-dir (pgpb-random-name))))
               (let ((new-file (concat filename pgpb-org-file-extension)))
                 (setq-local epa-file-encrypt-to pgpb-gpg-key)
                 (write-region pgpb-org-header nil new-file)
                 (find-file-other-window new-file)
                 (message new-file)))))))
   #+end_src

   #+RESULTS:
   : pgpb-org-new
   
   
   The file will be encrypted with the GPG key defined by the
   variable: 

   #+begin_src elisp :session none :tangle no
     pgpb-gpg-key
   #+end_src

   #+RESULTS:
   : "pgpb.padilla@gmail.com"
   

**** Listing GPG keys available in this system

     List (public) keys (=-k=):
     
     #+begin_src bash :session none :tangle no
       gpg -k pgpb.padilla
     #+end_src

     #+RESULTS:
     : pub   ed25519 2021-08-29 [SC] [verfällt: 2025-08-21]
     :       66BF0487843AB5B8F593F64124C50C592A8618EC
     : uid        [ ultimativ ] Pablo Padilla <pgpb.padilla@gmail.com>
     : sub   cv25519 2021-08-29 [E] [verfällt: 2025-08-21]
     : sub   rsa4096 2022-02-16 [E] [verfällt: 2025-08-21]
     :


     For listing private keys use =-K=.


